app/controllers/addresses_controller.rb

SELECT "addresses".* FROM "addresses"
---
  def index
    @addresses = Address.all

SELECT "addresses".* FROM "addresses" WHERE "addresses"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @address = Address.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
INSERT INTO "addresses" ("created_at", "state", "street_address", "updated_at", "user_id", "zip") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Sun, 22 Jul 2012 06:07:25 UTC +00:00], ["state", "FU"], ["street_address", "12345 FuckOff St"], ["updated_at", Sun, 22 Jul 2012 06:07:25 UTC +00:00], ["user_id", 1], ["zip", 999999]]
---
  def create
    @address = Address.new(:street_address => params[:address][:street_address],
      :state => params[:address][:state], :zip => params[:address][:zip])
    @address.user = User.find(params[:address][:user])

    respond_to do |format|
      if @address.save