app/controllers/check_ins_controller.rb

SELECT "places".* FROM "places" WHERE "places"."id" = $1 LIMIT 1  [["id", "dsa"]]
---
  def create
    @check_in = CheckIn.new(:time_staying => params[:check_in][:time_staying],
      :fee => params[:check_in][:fee])
    @check_in.user = User.find(params[:check_in][:user])
    @check_in.place = Place.find(params[:check_in][:place])