app/controllers/check_ins_controller.rb

  def index
    @check_ins = CheckIn.all
    @check_ins.sort! { |a,b| b.updated_at <=> a.updated_at }
    @places = Place.all
---
SELECT "check_ins".* FROM "check_ins"
SELECT "places".* FROM "places"

  def show
    @check_in = CheckIn.find(params[:id])
---
SELECT "check_ins".* FROM "check_ins" WHERE "check_ins"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    place = Place.find_or_create_by_place_id_and_name_and_lat_and_long(
      params[:place_id], params[:place_name], params[:place_lat],
      params[:place_long])
    @check_in = CheckIn.new(:time_staying => params[:time_staying],
      :fee => params[:fee])
    @check_in.user = User.find(params[:user])
    @check_in.place = place
    respond_to do |format|
      if @check_in.save
---
INSERT INTO "places" ("created_at", "lat", "long", "name", "place_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT "places".* FROM "places" WHERE "places"."place_id" = '22' AND "places"."name" = 'Chipotle' AND "places"."lat" = '49.5' AND "places"."long" = '84.5' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "Idiot"]]
INSERT INTO "check_ins" ("created_at", "fee", "place_id", "time_staying", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def destroy
    @check_in = CheckIn.find(params[:id])
    @check_in.destroy
---
SELECT "check_ins".* FROM "check_ins" WHERE "check_ins"."id" = $1 LIMIT 1  [["id", "4"]]
DELETE FROM "check_ins" WHERE "check_ins"."id" = $1  [["id", 4]]