app/controllers/requests_controller.rb

  def index
    if params[:check_in_id]
      @requests = CheckIn.find(params[:check_in_id]).requests
    else
      @requests = Request.all
---
SELECT "check_ins".* FROM "check_ins" WHERE "check_ins"."id" = 1 LIMIT 1
SELECT "requests".* FROM "requests" WHERE "requests"."check_in_id" = 1
SELECT "requests".* FROM "requests"

  def show
    @request = Request.find(params[:id])
---
SELECT "requests".* FROM "requests" WHERE "requests"."id" = $1 LIMIT 1  [["id", "edit"]]

  def new
    @request = Request.new
    @request.user = User.find(params['user'])
---
SELECT "requests".* FROM "requests" WHERE "requests"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    puts params.to_s
    @request = Request.new(:order => params[:request][:order],
      :details => params[:request][:details],
      :payment => params[:request][:payment])
    @request.user = User.find(params[:request][:user])
    @request.address = Address.find(params[:request][:address])
    @request.check_in = CheckIn.find(params[:request][:check_in])

    respond_to do |format|
      if @request.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "addresses".* FROM "addresses" WHERE "addresses"."id" = $1 LIMIT 1  [["id", ""]]
SELECT "check_ins".* FROM "check_ins" WHERE "check_ins"."id" = $1 LIMIT 1  [["id", "1"]]
INSERT INTO "requests" ("address_id", "check_in_id", "created_at", "details", "order", "payment", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"