app/controllers/requests_controller.rb

SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" = 1
---
  def new
    @request = Request.new
    @request.address = User.find(params['user']).addresses[0]